// - npm init -- инициализирует npm и создвет файл package.json
// - npm install -- устанавливает все зависимости перечисленные в package.json
// - npm list --depth=0 -- выведет в терминале список локально установленных пакетов с номерами их версий, без зависимостей
// - npm install [package-name] -- устанавливает пакет локально в папку node_modules
// - npm unistall [package-name] -- удалит пакет установленный локально и обновит package.json
// - npm start и npm test -- запустит скрипт start или test , расположенный в package.json
// - npm run [custom-script] -- запустит кастомный скрипт, расположенный в package.json
// - npm outdated -- используется для поиска обновлений, обнаружит сомвестимые версии программно и выведет список доступных обновлений
// - npm update -- обновит все пакеты до максимально разрешённой версии
